Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sercom.h
/* -------- SERCOM_I2CM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CM Control B -------- */
#define SERCOM_I2CM_CTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_I2CM_CTRLB) I2CM Control B  Reset Value */

#define SERCOM_I2CM_CTRLB_SMEN_Pos            _UINT32_(8)                                          /* (SERCOM_I2CM_CTRLB) Smart Mode Enable Position */
#define SERCOM_I2CM_CTRLB_SMEN_Msk            (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_SMEN_Pos)        /* (SERCOM_I2CM_CTRLB) Smart Mode Enable Mask */
#define SERCOM_I2CM_CTRLB_SMEN(value)         (SERCOM_I2CM_CTRLB_SMEN_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLB_SMEN_Pos)) /* Assigment of value for SMEN in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_QCEN_Pos            _UINT32_(9)                                          /* (SERCOM_I2CM_CTRLB) Quick Command Enable Position */
#define SERCOM_I2CM_CTRLB_QCEN_Msk            (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_QCEN_Pos)        /* (SERCOM_I2CM_CTRLB) Quick Command Enable Mask */
#define SERCOM_I2CM_CTRLB_QCEN(value)         (SERCOM_I2CM_CTRLB_QCEN_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLB_QCEN_Pos)) /* Assigment of value for QCEN in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_CMD_Pos             _UINT32_(16)                                         /* (SERCOM_I2CM_CTRLB) Command Position */
#define SERCOM_I2CM_CTRLB_CMD_Msk             (_UINT32_(0x3) << SERCOM_I2CM_CTRLB_CMD_Pos)         /* (SERCOM_I2CM_CTRLB) Command Mask */
#define SERCOM_I2CM_CTRLB_CMD(value)          (SERCOM_I2CM_CTRLB_CMD_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLB_CMD_Pos)) /* Assigment of value for CMD in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_ACKACT_Pos          _UINT32_(18)                                         /* (SERCOM_I2CM_CTRLB) Acknowledge Action Position */
#define SERCOM_I2CM_CTRLB_ACKACT_Msk          (_UINT32_(0x1) << SERCOM_I2CM_CTRLB_ACKACT_Pos)      /* (SERCOM_I2CM_CTRLB) Acknowledge Action Mask */
#define SERCOM_I2CM_CTRLB_ACKACT(value)       (SERCOM_I2CM_CTRLB_ACKACT_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLB_ACKACT_Pos)) /* Assigment of value for ACKACT in the SERCOM_I2CM_CTRLB register */
#define SERCOM_I2CM_CTRLB_FIFOCLR_Pos         _UINT32_(22)                                         /* (SERCOM_I2CM_CTRLB) FIFO Clear Position */
#define SERCOM_I2CM_CTRLB_FIFOCLR_Msk         (_UINT32_(0x3) << SERCOM_I2CM_CTRLB_FIFOCLR_Pos)     /* (SERCOM_I2CM_CTRLB) FIFO Clear Mask */
#define SERCOM_I2CM_CTRLB_FIFOCLR(value)      (SERCOM_I2CM_CTRLB_FIFOCLR_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLB_FIFOCLR_Pos)) /* Assigment of value for FIFOCLR in the SERCOM_I2CM_CTRLB register */
#define   SERCOM_I2CM_CTRLB_FIFOCLR_NONE_Val  _UINT32_(0x0)                                        /* (SERCOM_I2CM_CTRLB) No action  */
#define   SERCOM_I2CM_CTRLB_FIFOCLR_TXFIFO_Val _UINT32_(0x1)                                        /* (SERCOM_I2CM_CTRLB) Clear TX FIFO  */
#define   SERCOM_I2CM_CTRLB_FIFOCLR_RXFIFO_Val _UINT32_(0x2)                                        /* (SERCOM_I2CM_CTRLB) Clear RX FIFO  */
#define   SERCOM_I2CM_CTRLB_FIFOCLR_BOTH_Val  _UINT32_(0x3)                                        /* (SERCOM_I2CM_CTRLB) Clear both TX and RF FIFOs  */
#define SERCOM_I2CM_CTRLB_FIFOCLR_NONE        (SERCOM_I2CM_CTRLB_FIFOCLR_NONE_Val << SERCOM_I2CM_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CM_CTRLB) No action Position  */
#define SERCOM_I2CM_CTRLB_FIFOCLR_TXFIFO      (SERCOM_I2CM_CTRLB_FIFOCLR_TXFIFO_Val << SERCOM_I2CM_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CM_CTRLB) Clear TX FIFO Position  */
#define SERCOM_I2CM_CTRLB_FIFOCLR_RXFIFO      (SERCOM_I2CM_CTRLB_FIFOCLR_RXFIFO_Val << SERCOM_I2CM_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CM_CTRLB) Clear RX FIFO Position  */
#define SERCOM_I2CM_CTRLB_FIFOCLR_BOTH        (SERCOM_I2CM_CTRLB_FIFOCLR_BOTH_Val << SERCOM_I2CM_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CM_CTRLB) Clear both TX and RF FIFOs Position  */
#define SERCOM_I2CM_CTRLB_Msk                 _UINT32_(0x00C70300)                                 /* (SERCOM_I2CM_CTRLB) Register Mask  */


/* -------- SERCOM_I2CS_CTRLB : (SERCOM Offset: 0x04) (R/W 32) I2CS Control B -------- */
#define SERCOM_I2CS_CTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_I2CS_CTRLB) I2CS Control B  Reset Value */

#define SERCOM_I2CS_CTRLB_SMEN_Pos            _UINT32_(8)                                          /* (SERCOM_I2CS_CTRLB) Smart Mode Enable Position */
#define SERCOM_I2CS_CTRLB_SMEN_Msk            (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_SMEN_Pos)        /* (SERCOM_I2CS_CTRLB) Smart Mode Enable Mask */
#define SERCOM_I2CS_CTRLB_SMEN(value)         (SERCOM_I2CS_CTRLB_SMEN_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_SMEN_Pos)) /* Assigment of value for SMEN in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_GCMD_Pos            _UINT32_(9)                                          /* (SERCOM_I2CS_CTRLB) PMBus Group Command Position */
#define SERCOM_I2CS_CTRLB_GCMD_Msk            (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_GCMD_Pos)        /* (SERCOM_I2CS_CTRLB) PMBus Group Command Mask */
#define SERCOM_I2CS_CTRLB_GCMD(value)         (SERCOM_I2CS_CTRLB_GCMD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_GCMD_Pos)) /* Assigment of value for GCMD in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_AACKEN_Pos          _UINT32_(10)                                         /* (SERCOM_I2CS_CTRLB) Automatic Address Acknowledge Position */
#define SERCOM_I2CS_CTRLB_AACKEN_Msk          (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_AACKEN_Pos)      /* (SERCOM_I2CS_CTRLB) Automatic Address Acknowledge Mask */
#define SERCOM_I2CS_CTRLB_AACKEN(value)       (SERCOM_I2CS_CTRLB_AACKEN_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_AACKEN_Pos)) /* Assigment of value for AACKEN in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_AMODE_Pos           _UINT32_(14)                                         /* (SERCOM_I2CS_CTRLB) Address Mode Position */
#define SERCOM_I2CS_CTRLB_AMODE_Msk           (_UINT32_(0x3) << SERCOM_I2CS_CTRLB_AMODE_Pos)       /* (SERCOM_I2CS_CTRLB) Address Mode Mask */
#define SERCOM_I2CS_CTRLB_AMODE(value)        (SERCOM_I2CS_CTRLB_AMODE_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_AMODE_Pos)) /* Assigment of value for AMODE in the SERCOM_I2CS_CTRLB register */
#define   SERCOM_I2CS_CTRLB_AMODE_MASK_Val    _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLB) The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK  */
#define   SERCOM_I2CS_CTRLB_AMODE_2ADDRS_Val  _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK  */
#define   SERCOM_I2CS_CTRLB_AMODE_RANGE_Val   _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit  */
#define SERCOM_I2CS_CTRLB_AMODE_MASK          (SERCOM_I2CS_CTRLB_AMODE_MASK_Val << SERCOM_I2CS_CTRLB_AMODE_Pos) /* (SERCOM_I2CS_CTRLB) The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK Position  */
#define SERCOM_I2CS_CTRLB_AMODE_2ADDRS        (SERCOM_I2CS_CTRLB_AMODE_2ADDRS_Val << SERCOM_I2CS_CTRLB_AMODE_Pos) /* (SERCOM_I2CS_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK Position  */
#define SERCOM_I2CS_CTRLB_AMODE_RANGE         (SERCOM_I2CS_CTRLB_AMODE_RANGE_Val << SERCOM_I2CS_CTRLB_AMODE_Pos) /* (SERCOM_I2CS_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit Position  */
#define SERCOM_I2CS_CTRLB_CMD_Pos             _UINT32_(16)                                         /* (SERCOM_I2CS_CTRLB) Command Position */
#define SERCOM_I2CS_CTRLB_CMD_Msk             (_UINT32_(0x3) << SERCOM_I2CS_CTRLB_CMD_Pos)         /* (SERCOM_I2CS_CTRLB) Command Mask */
#define SERCOM_I2CS_CTRLB_CMD(value)          (SERCOM_I2CS_CTRLB_CMD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_CMD_Pos)) /* Assigment of value for CMD in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_ACKACT_Pos          _UINT32_(18)                                         /* (SERCOM_I2CS_CTRLB) Acknowledge Action Position */
#define SERCOM_I2CS_CTRLB_ACKACT_Msk          (_UINT32_(0x1) << SERCOM_I2CS_CTRLB_ACKACT_Pos)      /* (SERCOM_I2CS_CTRLB) Acknowledge Action Mask */
#define SERCOM_I2CS_CTRLB_ACKACT(value)       (SERCOM_I2CS_CTRLB_ACKACT_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_ACKACT_Pos)) /* Assigment of value for ACKACT in the SERCOM_I2CS_CTRLB register */
#define SERCOM_I2CS_CTRLB_FIFOCLR_Pos         _UINT32_(22)                                         /* (SERCOM_I2CS_CTRLB) FIFO Clear Position */
#define SERCOM_I2CS_CTRLB_FIFOCLR_Msk         (_UINT32_(0x3) << SERCOM_I2CS_CTRLB_FIFOCLR_Pos)     /* (SERCOM_I2CS_CTRLB) FIFO Clear Mask */
#define SERCOM_I2CS_CTRLB_FIFOCLR(value)      (SERCOM_I2CS_CTRLB_FIFOCLR_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLB_FIFOCLR_Pos)) /* Assigment of value for FIFOCLR in the SERCOM_I2CS_CTRLB register */
#define   SERCOM_I2CS_CTRLB_FIFOCLR_NONE_Val  _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLB) No action  */
#define   SERCOM_I2CS_CTRLB_FIFOCLR_TXFIFO_Val _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLB) Clear TX FIFO  */
#define   SERCOM_I2CS_CTRLB_FIFOCLR_RXFIFO_Val _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLB) Clear RX FIFO  */
#define   SERCOM_I2CS_CTRLB_FIFOCLR_BOTH_Val  _UINT32_(0x3)                                        /* (SERCOM_I2CS_CTRLB) Clear both TX and RF FIFOs  */
#define SERCOM_I2CS_CTRLB_FIFOCLR_NONE        (SERCOM_I2CS_CTRLB_FIFOCLR_NONE_Val << SERCOM_I2CS_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CS_CTRLB) No action Position  */
#define SERCOM_I2CS_CTRLB_FIFOCLR_TXFIFO      (SERCOM_I2CS_CTRLB_FIFOCLR_TXFIFO_Val << SERCOM_I2CS_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CS_CTRLB) Clear TX FIFO Position  */
#define SERCOM_I2CS_CTRLB_FIFOCLR_RXFIFO      (SERCOM_I2CS_CTRLB_FIFOCLR_RXFIFO_Val << SERCOM_I2CS_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CS_CTRLB) Clear RX FIFO Position  */
#define SERCOM_I2CS_CTRLB_FIFOCLR_BOTH        (SERCOM_I2CS_CTRLB_FIFOCLR_BOTH_Val << SERCOM_I2CS_CTRLB_FIFOCLR_Pos) /* (SERCOM_I2CS_CTRLB) Clear both TX and RF FIFOs Position  */
#define SERCOM_I2CS_CTRLB_Msk                 _UINT32_(0x00C7C700)                                 /* (SERCOM_I2CS_CTRLB) Register Mask  */


/* -------- SERCOM_SPIM_CTRLB : (SERCOM Offset: 0x04) (R/W 32) SPIM Control B -------- */
#define SERCOM_SPIM_CTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_SPIM_CTRLB) SPIM Control B  Reset Value */

#define SERCOM_SPIM_CTRLB_CHSIZE_Pos          _UINT32_(0)                                          /* (SERCOM_SPIM_CTRLB) Character Size Position */
#define SERCOM_SPIM_CTRLB_CHSIZE_Msk          (_UINT32_(0x7) << SERCOM_SPIM_CTRLB_CHSIZE_Pos)      /* (SERCOM_SPIM_CTRLB) Character Size Mask */
#define SERCOM_SPIM_CTRLB_CHSIZE(value)       (SERCOM_SPIM_CTRLB_CHSIZE_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_CHSIZE_Pos)) /* Assigment of value for CHSIZE in the SERCOM_SPIM_CTRLB register */
#define   SERCOM_SPIM_CTRLB_CHSIZE_8_BIT_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLB) 8-bits character  */
#define   SERCOM_SPIM_CTRLB_CHSIZE_9_BIT_Val  _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLB) 9-bits character  */
#define SERCOM_SPIM_CTRLB_CHSIZE_8_BIT        (SERCOM_SPIM_CTRLB_CHSIZE_8_BIT_Val << SERCOM_SPIM_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIM_CTRLB) 8-bits character Position  */
#define SERCOM_SPIM_CTRLB_CHSIZE_9_BIT        (SERCOM_SPIM_CTRLB_CHSIZE_9_BIT_Val << SERCOM_SPIM_CTRLB_CHSIZE_Pos) /* (SERCOM_SPIM_CTRLB) 9-bits character Position  */
#define SERCOM_SPIM_CTRLB_PLOADEN_Pos         _UINT32_(6)                                          /* (SERCOM_SPIM_CTRLB) Data Preload Enable Position */
#define SERCOM_SPIM_CTRLB_PLOADEN_Msk         (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_PLOADEN_Pos)     /* (SERCOM_SPIM_CTRLB) Data Preload Enable Mask */
#define SERCOM_SPIM_CTRLB_PLOADEN(value)      (SERCOM_SPIM_CTRLB_PLOADEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_PLOADEN_Pos)) /* Assigment of value for PLOADEN in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_SSDE_Pos            _UINT32_(9)                                          /* (SERCOM_SPIM_CTRLB) Slave Select Low Detect Enable Position */
#define SERCOM_SPIM_CTRLB_SSDE_Msk            (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_SSDE_Pos)        /* (SERCOM_SPIM_CTRLB) Slave Select Low Detect Enable Mask */
#define SERCOM_SPIM_CTRLB_SSDE(value)         (SERCOM_SPIM_CTRLB_SSDE_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_SSDE_Pos)) /* Assigment of value for SSDE in the SERCOM_SPIM_CTRLB register */
#define   SERCOM_SPIM_CTRLB_SSDE_DISABLE_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLB) SS low detector is disabled  */
#define   SERCOM_SPIM_CTRLB_SSDE_ENABLE_Val   _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLB) SS low detector is enabled  */
#define SERCOM_SPIM_CTRLB_SSDE_DISABLE        (SERCOM_SPIM_CTRLB_SSDE_DISABLE_Val << SERCOM_SPIM_CTRLB_SSDE_Pos) /* (SERCOM_SPIM_CTRLB) SS low detector is disabled Position  */
#define SERCOM_SPIM_CTRLB_SSDE_ENABLE         (SERCOM_SPIM_CTRLB_SSDE_ENABLE_Val << SERCOM_SPIM_CTRLB_SSDE_Pos) /* (SERCOM_SPIM_CTRLB) SS low detector is enabled Position  */
#define SERCOM_SPIM_CTRLB_MSSEN_Pos           _UINT32_(13)                                         /* (SERCOM_SPIM_CTRLB) Master Slave Select Enable Position */
#define SERCOM_SPIM_CTRLB_MSSEN_Msk           (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_MSSEN_Pos)       /* (SERCOM_SPIM_CTRLB) Master Slave Select Enable Mask */
#define SERCOM_SPIM_CTRLB_MSSEN(value)        (SERCOM_SPIM_CTRLB_MSSEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_MSSEN_Pos)) /* Assigment of value for MSSEN in the SERCOM_SPIM_CTRLB register */
#define   SERCOM_SPIM_CTRLB_MSSEN_DISABLE_Val _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLB) Hardware SS control is disabled  */
#define   SERCOM_SPIM_CTRLB_MSSEN_ENABLE_Val  _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLB) Hardware SS control is enabled  */
#define SERCOM_SPIM_CTRLB_MSSEN_DISABLE       (SERCOM_SPIM_CTRLB_MSSEN_DISABLE_Val << SERCOM_SPIM_CTRLB_MSSEN_Pos) /* (SERCOM_SPIM_CTRLB) Hardware SS control is disabled Position  */
#define SERCOM_SPIM_CTRLB_MSSEN_ENABLE        (SERCOM_SPIM_CTRLB_MSSEN_ENABLE_Val << SERCOM_SPIM_CTRLB_MSSEN_Pos) /* (SERCOM_SPIM_CTRLB) Hardware SS control is enabled Position  */
#define SERCOM_SPIM_CTRLB_AMODE_Pos           _UINT32_(14)                                         /* (SERCOM_SPIM_CTRLB) Address Mode Position */
#define SERCOM_SPIM_CTRLB_AMODE_Msk           (_UINT32_(0x3) << SERCOM_SPIM_CTRLB_AMODE_Pos)       /* (SERCOM_SPIM_CTRLB) Address Mode Mask */
#define SERCOM_SPIM_CTRLB_AMODE(value)        (SERCOM_SPIM_CTRLB_AMODE_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_AMODE_Pos)) /* Assigment of value for AMODE in the SERCOM_SPIM_CTRLB register */
#define   SERCOM_SPIM_CTRLB_AMODE_MASK_Val    _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLB) ADDRMASK is used as a mask to the AADR register  */
#define   SERCOM_SPIM_CTRLB_AMODE_2ADDRS_Val  _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK  */
#define   SERCOM_SPIM_CTRLB_AMODE_RANGE_Val   _UINT32_(0x2)                                        /* (SERCOM_SPIM_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit  */
#define SERCOM_SPIM_CTRLB_AMODE_MASK          (SERCOM_SPIM_CTRLB_AMODE_MASK_Val << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) ADDRMASK is used as a mask to the AADR register Position  */
#define SERCOM_SPIM_CTRLB_AMODE_2ADDRS        (SERCOM_SPIM_CTRLB_AMODE_2ADDRS_Val << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) The slave responds to the two unique addresses in ADDR and ADDRMASK Position  */
#define SERCOM_SPIM_CTRLB_AMODE_RANGE         (SERCOM_SPIM_CTRLB_AMODE_RANGE_Val << SERCOM_SPIM_CTRLB_AMODE_Pos) /* (SERCOM_SPIM_CTRLB) The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit Position  */
#define SERCOM_SPIM_CTRLB_RXEN_Pos            _UINT32_(17)                                         /* (SERCOM_SPIM_CTRLB) Receiver Enable Position */
#define SERCOM_SPIM_CTRLB_RXEN_Msk            (_UINT32_(0x1) << SERCOM_SPIM_CTRLB_RXEN_Pos)        /* (SERCOM_SPIM_CTRLB) Receiver Enable Mask */
#define SERCOM_SPIM_CTRLB_RXEN(value)         (SERCOM_SPIM_CTRLB_RXEN_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_RXEN_Pos)) /* Assigment of value for RXEN in the SERCOM_SPIM_CTRLB register */
#define SERCOM_SPIM_CTRLB_FIFOCLR_Pos         _UINT32_(22)                                         /* (SERCOM_SPIM_CTRLB) FIFO Clear Position */
#define SERCOM_SPIM_CTRLB_FIFOCLR_Msk         (_UINT32_(0x3) << SERCOM_SPIM_CTRLB_FIFOCLR_Pos)     /* (SERCOM_SPIM_CTRLB) FIFO Clear Mask */
#define SERCOM_SPIM_CTRLB_FIFOCLR(value)      (SERCOM_SPIM_CTRLB_FIFOCLR_Msk & (_UINT32_(value) << SERCOM_SPIM_CTRLB_FIFOCLR_Pos)) /* Assigment of value for FIFOCLR in the SERCOM_SPIM_CTRLB register */
#define   SERCOM_SPIM_CTRLB_FIFOCLR_NONE_Val  _UINT32_(0x0)                                        /* (SERCOM_SPIM_CTRLB) No action  */
#define   SERCOM_SPIM_CTRLB_FIFOCLR_TXFIFO_Val _UINT32_(0x1)                                        /* (SERCOM_SPIM_CTRLB) Clear TX FIFO  */
#define   SERCOM_SPIM_CTRLB_FIFOCLR_RXFIFO_Val _UINT32_(0x2)                                        /* (SERCOM_SPIM_CTRLB) Clear RX FIFO  */
#define   SERCOM_SPIM_CTRLB_FIFOCLR_BOTH_Val  _UINT32_(0x3)                                        /* (SERCOM_SPIM_CTRLB) Clear both TX and RF FIFOs  */
#define SERCOM_SPIM_CTRLB_FIFOCLR_NONE        (SERCOM_SPIM_CTRLB_FIFOCLR_NONE_Val << SERCOM_SPIM_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPIM_CTRLB) No action Position  */
#define SERCOM_SPIM_CTRLB_FIFOCLR_TXFIFO      (SERCOM_SPIM_CTRLB_FIFOCLR_TXFIFO_Val << SERCOM_SPIM_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPIM_CTRLB) Clear TX FIFO Position  */
#define SERCOM_SPIM_CTRLB_FIFOCLR_RXFIFO      (SERCOM_SPIM_CTRLB_FIFOCLR_RXFIFO_Val << SERCOM_SPIM_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPIM_CTRLB) Clear RX FIFO Position  */
#define SERCOM_SPIM_CTRLB_FIFOCLR_BOTH        (SERCOM_SPIM_CTRLB_FIFOCLR_BOTH_Val << SERCOM_SPIM_CTRLB_FIFOCLR_Pos) /* (SERCOM_SPIM_CTRLB) Clear both TX and RF FIFOs Position  */
#define SERCOM_SPIM_CTRLB_Msk                 _UINT32_(0x00C2E247)                                 /* (SERCOM_SPIM_CTRLB) Register Mask  */


/* -------- SERCOM_SPIS_CTRLB : (SERCOM Offset: 0x04) (R/W 32) SPIS Control B -------- */
#define SERCOM_SPIS_CTRLB_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_SPIS_CTRLB) SPIS Control B  Reset Value */

