Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sercom.h
#define SERCOM_I2CM_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_I2CM_CTRLC) Data 32 Bit Position */
#define SERCOM_I2CM_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_I2CM_CTRLC_DATA32B_Pos)     /* (SERCOM_I2CM_CTRLC) Data 32 Bit Mask */
#define SERCOM_I2CM_CTRLC_DATA32B(value)      (SERCOM_I2CM_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_DATA32B_Pos)) /* Assigment of value for DATA32B in the SERCOM_I2CM_CTRLC register */
#define SERCOM_I2CM_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_I2CM_CTRLC) FIFO Enable Position */
#define SERCOM_I2CM_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_I2CM_CTRLC_FIFOEN_Pos)      /* (SERCOM_I2CM_CTRLC) FIFO Enable Mask */
#define SERCOM_I2CM_CTRLC_FIFOEN(value)       (SERCOM_I2CM_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SERCOM_I2CM_CTRLC register */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_I2CM_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_I2CM_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_I2CM_CTRLC_RXTRHOLD(value)     (SERCOM_I2CM_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos)) /* Assigment of value for RXTRHOLD in the SERCOM_I2CM_CTRLC register */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_I2CM_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_I2CM_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position  */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_HALF       (SERCOM_I2CM_CTRLC_RXTRHOLD_HALF_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position  */
#define SERCOM_I2CM_CTRLC_RXTRHOLD_FULL       (SERCOM_I2CM_CTRLC_RXTRHOLD_FULL_Val << SERCOM_I2CM_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position  */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_I2CM_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_I2CM_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_I2CM_CTRLC_TXTRHOLD(value)     (SERCOM_I2CM_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos)) /* Assigment of value for TXTRHOLD in the SERCOM_I2CM_CTRLC register */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_I2CM_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_HALF       (SERCOM_I2CM_CTRLC_TXTRHOLD_HALF_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position  */
#define SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY      (SERCOM_I2CM_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_I2CM_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CM_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_I2CM_CTRLC_Msk                 _UINT32_(0xF9000000)                                 /* (SERCOM_I2CM_CTRLC) Register Mask  */


/* -------- SERCOM_I2CS_CTRLC : (SERCOM Offset: 0x08) (R/W 32) I2CS Control C -------- */
#define SERCOM_I2CS_CTRLC_RESETVALUE          _UINT32_(0x00)                                       /*  (SERCOM_I2CS_CTRLC) I2CS Control C  Reset Value */

#define SERCOM_I2CS_CTRLC_SDASETUP_Pos        _UINT32_(0)                                          /* (SERCOM_I2CS_CTRLC) SDA Setup Time Position */
#define SERCOM_I2CS_CTRLC_SDASETUP_Msk        (_UINT32_(0xF) << SERCOM_I2CS_CTRLC_SDASETUP_Pos)    /* (SERCOM_I2CS_CTRLC) SDA Setup Time Mask */
#define SERCOM_I2CS_CTRLC_SDASETUP(value)     (SERCOM_I2CS_CTRLC_SDASETUP_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_SDASETUP_Pos)) /* Assigment of value for SDASETUP in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_DATA32B_Pos         _UINT32_(24)                                         /* (SERCOM_I2CS_CTRLC) Data 32 Bit Position */
#define SERCOM_I2CS_CTRLC_DATA32B_Msk         (_UINT32_(0x1) << SERCOM_I2CS_CTRLC_DATA32B_Pos)     /* (SERCOM_I2CS_CTRLC) Data 32 Bit Mask */
#define SERCOM_I2CS_CTRLC_DATA32B(value)      (SERCOM_I2CS_CTRLC_DATA32B_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_DATA32B_Pos)) /* Assigment of value for DATA32B in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_FIFOEN_Pos          _UINT32_(27)                                         /* (SERCOM_I2CS_CTRLC) FIFO Enable Position */
#define SERCOM_I2CS_CTRLC_FIFOEN_Msk          (_UINT32_(0x1) << SERCOM_I2CS_CTRLC_FIFOEN_Pos)      /* (SERCOM_I2CS_CTRLC) FIFO Enable Mask */
#define SERCOM_I2CS_CTRLC_FIFOEN(value)       (SERCOM_I2CS_CTRLC_FIFOEN_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_FIFOEN_Pos)) /* Assigment of value for FIFOEN in the SERCOM_I2CS_CTRLC register */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_Pos        _UINT32_(28)                                         /* (SERCOM_I2CS_CTRLC) Receive FIFO Threshold Position */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos)    /* (SERCOM_I2CS_CTRLC) Receive FIFO Threshold Mask */
#define SERCOM_I2CS_CTRLC_RXTRHOLD(value)     (SERCOM_I2CS_CTRLC_RXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos)) /* Assigment of value for RXTRHOLD in the SERCOM_I2CS_CTRLC register */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO  */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full  */
#define   SERCOM_I2CS_CTRLC_RXTRHOLD_FULL_Val _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full  */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT    (SERCOM_I2CS_CTRLC_RXTRHOLD_DEFAULT_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when DATA is present in the FIFO Position  */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_HALF       (SERCOM_I2CS_CTRLC_RXTRHOLD_HALF_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is half-full Position  */
#define SERCOM_I2CS_CTRLC_RXTRHOLD_FULL       (SERCOM_I2CS_CTRLC_RXTRHOLD_FULL_Val << SERCOM_I2CS_CTRLC_RXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when FIFO is full Position  */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_Pos        _UINT32_(30)                                         /* (SERCOM_I2CS_CTRLC) Transmit FIFO Threshold Position */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_Msk        (_UINT32_(0x3) << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos)    /* (SERCOM_I2CS_CTRLC) Transmit FIFO Threshold Mask */
#define SERCOM_I2CS_CTRLC_TXTRHOLD(value)     (SERCOM_I2CS_CTRLC_TXTRHOLD_Msk & (_UINT32_(value) << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos)) /* Assigment of value for TXTRHOLD in the SERCOM_I2CS_CTRLC register */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT_Val _UINT32_(0x0)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_HALF_Val _UINT32_(0x1)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free  */
#define   SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY_Val _UINT32_(0x2)                                        /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full  */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT    (SERCOM_I2CS_CTRLC_TXTRHOLD_DEFAULT_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_HALF       (SERCOM_I2CS_CTRLC_TXTRHOLD_HALF_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated when half FIFO space is free Position  */
#define SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY      (SERCOM_I2CS_CTRLC_TXTRHOLD_EMPTY_Val << SERCOM_I2CS_CTRLC_TXTRHOLD_Pos) /* (SERCOM_I2CS_CTRLC) Interrupt and DMA triggers are generated as long as the FIFO is not full Position  */
#define SERCOM_I2CS_CTRLC_Msk                 _UINT32_(0xF900000F)                                 /* (SERCOM_I2CS_CTRLC) Register Mask  */


