Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sercom.h
/* -------- SERCOM_SPIS_DBGCTRL : (SERCOM Offset: 0x30) (R/W 8) SPIS Debug Control -------- */
#define SERCOM_SPIS_DBGCTRL_RESETVALUE        _UINT8_(0x00)                                        /*  (SERCOM_SPIS_DBGCTRL) SPIS Debug Control  Reset Value */

#define SERCOM_SPIS_DBGCTRL_DBGSTOP_Pos       _UINT8_(0)                                           /* (SERCOM_SPIS_DBGCTRL) Debug Mode Position */
#define SERCOM_SPIS_DBGCTRL_DBGSTOP_Msk       (_UINT8_(0x1) << SERCOM_SPIS_DBGCTRL_DBGSTOP_Pos)    /* (SERCOM_SPIS_DBGCTRL) Debug Mode Mask */
#define SERCOM_SPIS_DBGCTRL_DBGSTOP(value)    (SERCOM_SPIS_DBGCTRL_DBGSTOP_Msk & (_UINT8_(value) << SERCOM_SPIS_DBGCTRL_DBGSTOP_Pos)) /* Assigment of value for DBGSTOP in the SERCOM_SPIS_DBGCTRL register */
#define SERCOM_SPIS_DBGCTRL_Msk               _UINT8_(0x01)                                        /* (SERCOM_SPIS_DBGCTRL) Register Mask  */


/* -------- SERCOM_USART_INT_DBGCTRL : (SERCOM Offset: 0x30) (R/W 8) USART Debug Control -------- */
#define SERCOM_USART_INT_DBGCTRL_RESETVALUE   _UINT8_(0x00)                                        /*  (SERCOM_USART_INT_DBGCTRL) USART Debug Control  Reset Value */

#define SERCOM_USART_INT_DBGCTRL_DBGSTOP_Pos  _UINT8_(0)                                           /* (SERCOM_USART_INT_DBGCTRL) Debug Mode Position */
#define SERCOM_USART_INT_DBGCTRL_DBGSTOP_Msk  (_UINT8_(0x1) << SERCOM_USART_INT_DBGCTRL_DBGSTOP_Pos) /* (SERCOM_USART_INT_DBGCTRL) Debug Mode Mask */
#define SERCOM_USART_INT_DBGCTRL_DBGSTOP(value) (SERCOM_USART_INT_DBGCTRL_DBGSTOP_Msk & (_UINT8_(value) << SERCOM_USART_INT_DBGCTRL_DBGSTOP_Pos)) /* Assigment of value for DBGSTOP in the SERCOM_USART_INT_DBGCTRL register */
#define SERCOM_USART_INT_DBGCTRL_Msk          _UINT8_(0x01)                                        /* (SERCOM_USART_INT_DBGCTRL) Register Mask  */


/* -------- SERCOM_I2CM_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) I2CM FIFO Space -------- */
#define SERCOM_I2CM_FIFOSPACE_RESETVALUE      _UINT16_(0x00)                                       /*  (SERCOM_I2CM_FIFOSPACE) I2CM FIFO Space  Reset Value */

#define SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_I2CM_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_I2CM_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_I2CM_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_I2CM_FIFOSPACE_TXSPACE(value)  (SERCOM_I2CM_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOSPACE_TXSPACE_Pos)) /* Assigment of value for TXSPACE in the SERCOM_I2CM_FIFOSPACE register */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_I2CM_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_I2CM_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_I2CM_FIFOSPACE_RXSPACE(value)  (SERCOM_I2CM_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CM_FIFOSPACE_RXSPACE_Pos)) /* Assigment of value for RXSPACE in the SERCOM_I2CM_FIFOSPACE register */
#define SERCOM_I2CM_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_I2CM_FIFOSPACE) Register Mask  */


/* -------- SERCOM_I2CS_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) I2CS FIFO Space -------- */
#define SERCOM_I2CS_FIFOSPACE_RESETVALUE      _UINT16_(0x00)                                       /*  (SERCOM_I2CS_FIFOSPACE) I2CS FIFO Space  Reset Value */

#define SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_I2CS_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_I2CS_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_I2CS_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_I2CS_FIFOSPACE_TXSPACE(value)  (SERCOM_I2CS_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOSPACE_TXSPACE_Pos)) /* Assigment of value for TXSPACE in the SERCOM_I2CS_FIFOSPACE register */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_I2CS_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_I2CS_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_I2CS_FIFOSPACE_RXSPACE(value)  (SERCOM_I2CS_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_I2CS_FIFOSPACE_RXSPACE_Pos)) /* Assigment of value for RXSPACE in the SERCOM_I2CS_FIFOSPACE register */
#define SERCOM_I2CS_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_I2CS_FIFOSPACE) Register Mask  */


/* -------- SERCOM_SPIM_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) SPIM FIFO Space -------- */
#define SERCOM_SPIM_FIFOSPACE_RESETVALUE      _UINT16_(0x00)                                       /*  (SERCOM_SPIM_FIFOSPACE) SPIM FIFO Space  Reset Value */

#define SERCOM_SPIM_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_SPIM_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_SPIM_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_SPIM_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_SPIM_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_SPIM_FIFOSPACE_TXSPACE(value)  (SERCOM_SPIM_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_SPIM_FIFOSPACE_TXSPACE_Pos)) /* Assigment of value for TXSPACE in the SERCOM_SPIM_FIFOSPACE register */
#define SERCOM_SPIM_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_SPIM_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_SPIM_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_SPIM_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_SPIM_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_SPIM_FIFOSPACE_RXSPACE(value)  (SERCOM_SPIM_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_SPIM_FIFOSPACE_RXSPACE_Pos)) /* Assigment of value for RXSPACE in the SERCOM_SPIM_FIFOSPACE register */
#define SERCOM_SPIM_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_SPIM_FIFOSPACE) Register Mask  */


/* -------- SERCOM_SPIS_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) SPIS FIFO Space -------- */
#define SERCOM_SPIS_FIFOSPACE_RESETVALUE      _UINT16_(0x00)                                       /*  (SERCOM_SPIS_FIFOSPACE) SPIS FIFO Space  Reset Value */

#define SERCOM_SPIS_FIFOSPACE_TXSPACE_Pos     _UINT16_(0)                                          /* (SERCOM_SPIS_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_SPIS_FIFOSPACE_TXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_SPIS_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_SPIS_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_SPIS_FIFOSPACE_TXSPACE(value)  (SERCOM_SPIS_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_SPIS_FIFOSPACE_TXSPACE_Pos)) /* Assigment of value for TXSPACE in the SERCOM_SPIS_FIFOSPACE register */
#define SERCOM_SPIS_FIFOSPACE_RXSPACE_Pos     _UINT16_(8)                                          /* (SERCOM_SPIS_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_SPIS_FIFOSPACE_RXSPACE_Msk     (_UINT16_(0x1F) << SERCOM_SPIS_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_SPIS_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_SPIS_FIFOSPACE_RXSPACE(value)  (SERCOM_SPIS_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_SPIS_FIFOSPACE_RXSPACE_Pos)) /* Assigment of value for RXSPACE in the SERCOM_SPIS_FIFOSPACE register */
#define SERCOM_SPIS_FIFOSPACE_Msk             _UINT16_(0x1F1F)                                     /* (SERCOM_SPIS_FIFOSPACE) Register Mask  */


/* -------- SERCOM_USART_INT_FIFOSPACE : (SERCOM Offset: 0x34) ( R/ 16) USART FIFO Space -------- */
#define SERCOM_USART_INT_FIFOSPACE_RESETVALUE _UINT16_(0x00)                                       /*  (SERCOM_USART_INT_FIFOSPACE) USART FIFO Space  Reset Value */

#define SERCOM_USART_INT_FIFOSPACE_TXSPACE_Pos _UINT16_(0)                                          /* (SERCOM_USART_INT_FIFOSPACE) Tx FIFO Empty Space Position */
#define SERCOM_USART_INT_FIFOSPACE_TXSPACE_Msk (_UINT16_(0x1F) << SERCOM_USART_INT_FIFOSPACE_TXSPACE_Pos) /* (SERCOM_USART_INT_FIFOSPACE) Tx FIFO Empty Space Mask */
#define SERCOM_USART_INT_FIFOSPACE_TXSPACE(value) (SERCOM_USART_INT_FIFOSPACE_TXSPACE_Msk & (_UINT16_(value) << SERCOM_USART_INT_FIFOSPACE_TXSPACE_Pos)) /* Assigment of value for TXSPACE in the SERCOM_USART_INT_FIFOSPACE register */
#define SERCOM_USART_INT_FIFOSPACE_RXSPACE_Pos _UINT16_(8)                                          /* (SERCOM_USART_INT_FIFOSPACE) Rx FIFO Filled Space Position */
#define SERCOM_USART_INT_FIFOSPACE_RXSPACE_Msk (_UINT16_(0x1F) << SERCOM_USART_INT_FIFOSPACE_RXSPACE_Pos) /* (SERCOM_USART_INT_FIFOSPACE) Rx FIFO Filled Space Mask */
#define SERCOM_USART_INT_FIFOSPACE_RXSPACE(value) (SERCOM_USART_INT_FIFOSPACE_RXSPACE_Msk & (_UINT16_(value) << SERCOM_USART_INT_FIFOSPACE_RXSPACE_Pos)) /* Assigment of value for RXSPACE in the SERCOM_USART_INT_FIFOSPACE register */
#define SERCOM_USART_INT_FIFOSPACE_Msk        _UINT16_(0x1F1F)                                     /* (SERCOM_USART_INT_FIFOSPACE) Register Mask  */


